name: "vanila"

layer {
	name: "data"
	type: "Input"
	top: "data"
	input_param {
		shape: {dim: 1 dim: 1 dim: 40 dim: 40}
	}
}
layer {
    name: "Conv1"
    type: "Convolution"
    bottom: "data"
    top: "Conv1"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 64
        pad: 2
        kernel_size: 5
        stride: 1
        weight_filler {
            type: "xavier"
            std: 0.1
        }
        bias_filler {
            type: "constant"
            value: 0.2
        }
    }
}

layer {

    bottom: "Conv1"
    top: "Conv1"
    name: "bn_conv1"
    type: "BatchNorm"
    batch_norm_param {
    moving_average_fraction: 0.9 
    }

}

layer {

    bottom: "Conv1"
    top: "Conv1"
    name: "scale_conv1"
    type: "Scale"
    scale_param {
        bias_term: true
    }
}

layer {

    bottom: "Conv1"
    top: "Conv1"
    name: "conv1_relu"
    type: "ReLU"

}
layer {
    name: "Pool1"
    type: "Pooling"
    bottom: "Conv1"
    top: "Pool1"
    pooling_param {
        pool: MAX
        kernel_size: 2
        stride: 2
    }
}

layer {
    name: "Conv2"
    type: "Convolution"
    bottom: "Pool1"
    top: "Conv2"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 64
        pad: 1
        kernel_size: 3
        stride: 1
        weight_filler {
        type: "xavier"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0.2
        }
    }
}

layer {

    bottom: "Conv2"
    top: "Conv2"
    name: "bn_conv2"
    type: "BatchNorm"
    batch_norm_param {
      moving_average_fraction: 0.9 
    }
}

layer {

    bottom: "Conv2"
    top: "Conv2"
    name: "scale_conv2"
    type: "Scale"
    scale_param {
        bias_term: true
    }

}

layer {
    bottom: "Conv2"
    top: "Conv2"
    name: "conv2_relu"
    type: "ReLU"
}

layer {
    name: "Conv22"
    type: "Convolution"
    bottom: "Conv2"
    top: "Conv22"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 64
        pad: 1
        kernel_size: 3
        stride: 1
        weight_filler {
        type: "xavier"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0.2
        }
    }
}

layer {

    bottom: "Conv22"
    top: "Conv22"
    name: "bn_conv22"
    type: "BatchNorm"
    batch_norm_param {
      moving_average_fraction: 0.9 
    }
}

layer {

    bottom: "Conv22"
    top: "Conv22"
    name: "scale_conv22"
    type: "Scale"
    scale_param {
        bias_term: true
    }

}

layer {
    bottom: "Conv22"
    top: "Conv22"
    name: "conv22_relu"
    type: "ReLU"
}

layer {
    name: "Pool2"
    type: "Pooling"
    bottom: "Conv22"
    top: "Pool2"
    pooling_param {
        pool: MAX
        kernel_size: 2
        stride: 2
    }
}

# layer 3
layer {
    name: "Conv3"
    type: "Convolution"
    bottom: "Pool2"
    top: "Conv3"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 128
        pad: 0
        kernel_size: 3
        stride: 1
        weight_filler {
            type: "xavier"
            std: 0.1
        }
        bias_filler {
            type: "constant"
            value: 0.2
        }
    }
}


layer {

    bottom: "Conv3"
    top: "Conv3"
    name: "bn_conv3"
    type: "BatchNorm"
    batch_norm_param {
      moving_average_fraction: 0.9 
    }

}

layer {

    bottom: "Conv3"
    top: "Conv3"
    name: "scale_conv3"
    type: "Scale"
    scale_param {
        bias_term: true
    }

}

layer {

    bottom: "Conv3"
    top: "Conv3"
    name: "conv3_relu"
    type: "ReLU"

}

layer {
    name: "Pool3"
    type: "Pooling"
    bottom: "Conv3"
    top: "Pool3"
    pooling_param {
        pool: MAX
        kernel_size: 3
        stride: 2
    }
}

# layer 4
layer {
    name: "Conv4"
    type: "Convolution"
    bottom: "Pool3"
    top: "Conv4"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 256
        pad: 0
        kernel_size: 2
        stride: 1
        weight_filler {
            type: "xavier"
            std: 0.1
        }
        bias_filler {
            type: "constant"
            value: 0.2
        }
    }
}


layer {

    bottom: "Conv4"
    top: "Conv4"
    name: "bn_conv4"
    type: "BatchNorm"
    batch_norm_param {
      moving_average_fraction: 0.9 

    }

}

layer {

    bottom: "Conv4"
    top: "Conv4"
    name: "scale_conv4"
    type: "Scale"
    scale_param {
        bias_term: true

    }

}

layer {

    bottom: "Conv4"
    top: "Conv4"
    name: "conv4_relu"
    type: "ReLU"

}

layer {
    name: "Conv44"
    type: "Convolution"
    bottom: "Conv4"
    top: "Conv44"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 256
        pad: 0
        kernel_size: 2
        stride: 1
        weight_filler {
            type: "xavier"
            std: 0.1
        }
        bias_filler {
            type: "constant"
            value: 0.2
        }
    }
}


layer {

    bottom: "Conv44"
    top: "Conv44"
    name: "bn_conv44"
    type: "BatchNorm"
    batch_norm_param {
      moving_average_fraction: 0.9 

    }

}

layer {

    bottom: "Conv44"
    top: "Conv44"
    name: "scale_conv44"
    type: "Scale"
    scale_param {
        bias_term: true

    }

}

layer {

    bottom: "Conv44"
    top: "Conv44"
    name: "conv44_relu"
    type: "ReLU"

}

########################################

layer {
    name: "Dense1"
    type: "InnerProduct"
    bottom: "Conv44"
    top: "Dense1"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    inner_product_param {
        num_output: 256
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0
        }
    }
}

layer {

    bottom: "Dense1"
    top: "Dense1"
    name: "bn_Dense1"
    type: "BatchNorm"
    batch_norm_param {
      moving_average_fraction: 0.9 

    }

}

layer {

    bottom: "Dense1"
    top: "Dense1"
    name: "scale_Dense1"
    type: "Scale"
    scale_param {
        bias_term: true

    }

}

layer {

    bottom: "Dense1"
    top: "Dense1"
    name: "Dense1_relu"
    type: "ReLU"

}


layer {
    name: "Dense2"
    type: "InnerProduct"
    bottom: "Dense1"
    top: "Dense2"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    inner_product_param {
        num_output: 136
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0
        }
    }
}